OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/RANSCase1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       6304;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       6320;
    }
    leftSides_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       6336;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftSides_periodic1;
    }
    leftSides_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       6652;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftSides_periodic0;
    }
    rightSides_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       6968;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightSides_periodic1;
    }
    rightSides_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       7284;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightSides_periodic0;
    }
    leftInOut_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       7600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftInOut_periodic1;
    }
    leftInOut_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       7916;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftInOut_periodic0;
    }
    rightInOut_periodic0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       8232;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightInOut_periodic1;
    }
    rightInOut_periodic1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          316;
        startFace       8548;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightInOut_periodic0;
    }
)

// ************************************************************************* //
